### Terraform `plan` Succeeded for Workspace: `staging`
<details><summary>Show Output</summary>

```diff
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_cloudfront_origin_access_identity.web-oai has been changed
!   resource "aws_cloudfront_origin_access_identity" "web-oai" {
!       etag                            = "E2HTUKGV4JR8MO" -> "EULIVC2ZC61F8"
        id                              = "E2H1F6CISP8OLG"
        # (5 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_acm_certificate.five-e-tools will be created
+   resource "aws_acm_certificate" "five-e-tools" {
+       arn                       = (known after apply)
+       domain_name               = "5e.staging.zbmowrey.com"
+       domain_validation_options = [
+           {
+               domain_name           = "5e.staging.zbmowrey.com"
+               resource_record_name  = (known after apply)
+               resource_record_type  = (known after apply)
+               resource_record_value = (known after apply)
            },
        ]
+       id                        = (known after apply)
+       status                    = (known after apply)
+       subject_alternative_names = (known after apply)
+       tags                      = {
+           "CostCenter" = "5e-zbmowrey-com"
+           "Name"       = "5e-tools Managed by Terraform"
        }
+       tags_all                  = {
+           "CostCenter"  = "5e-zbmowrey-com"
+           "Environment" = "staging"
+           "Name"        = "5e-tools Managed by Terraform"
+           "Owner"       = "zbmowrey"
+           "Terraform"   = "true"
        }
+       validation_emails         = (known after apply)
+       validation_method         = "DNS"
    }

  # aws_cloudfront_distribution.five-e-tools will be created
+   resource "aws_cloudfront_distribution" "five-e-tools" {
+       aliases                        = [
+           "5e.staging.zbmowrey.com",
        ]
+       arn                            = (known after apply)
+       caller_reference               = (known after apply)
+       default_root_object            = "index.html"
+       domain_name                    = (known after apply)
+       enabled                        = true
+       etag                           = (known after apply)
+       hosted_zone_id                 = (known after apply)
+       http_version                   = "http2"
+       id                             = (known after apply)
+       in_progress_validation_batches = (known after apply)
+       is_ipv6_enabled                = false
+       last_modified_time             = (known after apply)
+       price_class                    = "PriceClass_100"
+       retain_on_delete               = false
+       status                         = (known after apply)
+       tags                           = {
+           "CostCenter"  = "5e-zbmowrey-com"
+           "Description" = "5e-zbmowrey-com-staging"
        }
+       tags_all                       = {
+           "CostCenter"  = "5e-zbmowrey-com"
+           "Description" = "5e-zbmowrey-com-staging"
+           "Environment" = "staging"
+           "Owner"       = "zbmowrey"
+           "Terraform"   = "true"
        }
+       trusted_key_groups             = (known after apply)
+       trusted_signers                = (known after apply)
+       wait_for_deployment            = true

+       custom_error_response {
+           error_caching_min_ttl = 30
+           error_code            = 403
+           response_code         = 200
+           response_page_path    = "/index.html"
        }
+       custom_error_response {
+           error_caching_min_ttl = 30
+           error_code            = 404
+           response_code         = 200
+           response_page_path    = "/index.html"
        }

+       default_cache_behavior {
+           allowed_methods        = [
+               "GET",
+               "HEAD",
+               "OPTIONS",
            ]
+           cached_methods         = [
+               "GET",
+               "HEAD",
+               "OPTIONS",
            ]
+           compress               = true
+           default_ttl            = 3600
+           max_ttl                = 86400
+           min_ttl                = 0
+           target_origin_id       = "staging-5e-origin"
+           trusted_key_groups     = (known after apply)
+           trusted_signers        = (known after apply)
+           viewer_protocol_policy = "redirect-to-https"

+           forwarded_values {
+               headers                 = (known after apply)
+               query_string            = false
+               query_string_cache_keys = (known after apply)

+               cookies {
+                   forward           = "all"
+                   whitelisted_names = (known after apply)
                }
            }
        }

+       origin {
+           connection_attempts = 3
+           connection_timeout  = 10
+           domain_name         = (known after apply)
+           origin_id           = "staging-5e-origin"

+           s3_origin_config {
+               origin_access_identity = (known after apply)
            }
        }

+       restrictions {
+           geo_restriction {
+               locations        = [
+                   "US",
                ]
+               restriction_type = "whitelist"
            }
        }

+       viewer_certificate {
+           acm_certificate_arn            = (known after apply)
+           cloudfront_default_certificate = false
+           minimum_protocol_version       = "TLSv1"
+           ssl_support_method             = "sni-only"
        }
    }

  # aws_cloudfront_origin_access_identity.five-e-tools will be created
+   resource "aws_cloudfront_origin_access_identity" "five-e-tools" {
+       caller_reference                = (known after apply)
+       cloudfront_access_identity_path = (known after apply)
+       comment                         = "Managed by 5e-zbmowrey-com-staging terraform"
+       etag                            = (known after apply)
+       iam_arn                         = (known after apply)
+       id                              = (known after apply)
+       s3_canonical_user_id            = (known after apply)
    }

  # aws_cloudwatch_log_group.gilfoyle will be created
+   resource "aws_cloudwatch_log_group" "gilfoyle" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       name              = "zbmowrey-com-staging-gilfoyle-logs"
+       retention_in_days = 0
+       tags_all          = {
+           "CostCenter"  = "zbmowrey-com"
+           "Environment" = "staging"
+           "Owner"       = "zbmowrey"
+           "Terraform"   = "true"
        }
    }

  # aws_dynamodb_table.global-store will be created
+   resource "aws_dynamodb_table" "global-store" {
+       arn              = (known after apply)
+       billing_mode     = "PAY_PER_REQUEST"
+       hash_key         = "k"
+       id               = (known after apply)
+       name             = "GlobalStore"
+       stream_arn       = (known after apply)
+       stream_label     = (known after apply)
+       stream_view_type = (known after apply)
+       tags             = {
+           "CostCenter" = "zbmowrey-global"
        }
+       tags_all         = {
+           "CostCenter"  = "zbmowrey-global"
+           "Environment" = "staging"
+           "Owner"       = "zbmowrey"
+           "Terraform"   = "true"
        }

+       attribute {
+           name = "k"
+           type = "S"
        }

+       point_in_time_recovery {
+           enabled = (known after apply)
        }

+       server_side_encryption {
+           enabled     = (known after apply)
+           kms_key_arn = (known after apply)
        }

+       ttl {
+           attribute_name = "ExpiresAt"
+           enabled        = true
+           kms_key_arn    = (known after apply)
        }
    }

  # aws_lambda_permission.gilfoyle will be created
+   resource "aws_lambda_permission" "gilfoyle" {
+       action        = "lambda:InvokeFunction"
+       function_name = "zbmowrey-com-staging-gilfoyle"
+       id            = (known after apply)
+       principal     = "apigateway.amazonaws.com"
+       source_arn    = (known after apply)
+       statement_id  = "AllowGilfoyleLambdaInvoke"
    }

  # aws_route53_record.five-e-tools will be created
+   resource "aws_route53_record" "five-e-tools" {
+       allow_overwrite = (known after apply)
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = "5e.staging.zbmowrey.com"
+       type            = "A"
+       zone_id         = "Z04881492U0KUA4NHB19T"

+       alias {
+           evaluate_target_health = false
+           name                   = (known after apply)
+           zone_id                = (known after apply)
        }
    }

  # aws_route53_record.gilfoyle will be created
+   resource "aws_route53_record" "gilfoyle" {
+       allow_overwrite = (known after apply)
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = "gilfoyle.staging.zbmowrey.com"
+       records         = (known after apply)
+       ttl             = 300
+       type            = "CNAME"
+       zone_id         = "Z04881492U0KUA4NHB19T"
    }

  # aws_s3_bucket.five-e-tools will be created
+   resource "aws_s3_bucket" "five-e-tools" {
+       acceleration_status         = (known after apply)
+       acl                         = "public-read"
+       arn                         = (known after apply)
+       bucket                      = "5e-zbmowrey-com-staging-web-primary"
+       bucket_domain_name          = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       policy                      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = [
+                           "s3:GetObject",
+                           "s3:GetObjectVersion",
                        ]
+                       Effect    = "Allow"
+                       Principal = "*"
+                       Resource  = [
+                           "arn:aws:s3:::5e-zbmowrey-com-staging-web-primary/*",
                        ]
+                       Sid       = "PublicRead"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags                        = {
+           "CostCenter" = "5e-zbmowrey-com"
        }
+       tags_all                    = {
+           "CostCenter"  = "5e-zbmowrey-com"
+           "Environment" = "staging"
+           "Owner"       = "zbmowrey"
+           "Terraform"   = "true"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       versioning {
+           enabled    = (known after apply)
+           mfa_delete = (known after apply)
        }

+       website {
+           error_document = "index.html"
+           index_document = "index.html"
        }
    }

  # aws_s3_bucket.stl will be created
+   resource "aws_s3_bucket" "stl" {
+       acceleration_status         = (known after apply)
+       acl                         = "public-read"
+       arn                         = (known after apply)
+       bucket                      = "stl-zbmowrey-com-staging-web-primary"
+       bucket_domain_name          = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       policy                      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = [
+                           "s3:GetObject",
+                           "s3:GetObjectVersion",
                        ]
+                       Effect    = "Allow"
+                       Principal = "*"
+                       Resource  = [
+                           "arn:aws:s3:::stl-zbmowrey-com-staging-web-primary/*",
                        ]
+                       Sid       = "PublicRead"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags                        = {
+           "CostCenter" = "stl-zbmowrey-com"
        }
+       tags_all                    = {
+           "CostCenter"  = "stl-zbmowrey-com"
+           "Environment" = "staging"
+           "Owner"       = "zbmowrey"
+           "Terraform"   = "true"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       versioning {
+           enabled    = (known after apply)
+           mfa_delete = (known after apply)
        }
    }

  # module.gilfoyle-api.aws_apigatewayv2_api.this[0] will be created
+   resource "aws_apigatewayv2_api" "this" {
+       api_endpoint                 = (known after apply)
+       api_key_selection_expression = "$request.header.x-api-key"
+       arn                          = (known after apply)
+       description                  = "API Gateway for Gilfoyle Slack Bot"
+       disable_execute_api_endpoint = false
+       execution_arn                = (known after apply)
+       id                           = (known after apply)
+       name                         = "staging.zbmowrey.com-gilfoyle"
+       protocol_type                = "HTTP"
+       route_selection_expression   = "$request.method $request.path"
+       tags                         = {
+           "Module" = "lambda-web-mail"
+           "Name"   = "web-mail-api"
        }
+       tags_all                     = {
+           "CostCenter"  = "zbmowrey-com"
+           "Environment" = "staging"
+           "Module"      = "lambda-web-mail"
+           "Name"        = "web-mail-api"
+           "Owner"       = "zbmowrey"
+           "Terraform"   = "true"
        }

+       cors_configuration {
+           allow_headers = [
+               "authorization",
+               "content-type",
+               "x-amz-date",
+               "x-amz-security-token",
+               "x-amz-user-agent",
+               "x-api-key",
            ]
+           allow_methods = [
+               "*",
            ]
+           allow_origins = [
+               "*",
            ]
        }
    }

  # module.gilfoyle-api.aws_apigatewayv2_api_mapping.this[0] will be created
+   resource "aws_apigatewayv2_api_mapping" "this" {
+       api_id      = (known after apply)
+       domain_name = (known after apply)
+       id          = (known after apply)
+       stage       = (known after apply)
    }

  # module.gilfoyle-api.aws_apigatewayv2_domain_name.this[0] will be created
+   resource "aws_apigatewayv2_domain_name" "this" {
+       api_mapping_selection_expression = (known after apply)
+       arn                              = (known after apply)
+       domain_name                      = "gilfoyle.staging.zbmowrey.com"
+       id                               = (known after apply)
+       tags                             = {
+           "Module" = "lambda-web-mail"
+           "Name"   = "web-mail-api"
        }
+       tags_all                         = {
+           "CostCenter"  = "zbmowrey-com"
+           "Environment" = "staging"
+           "Module"      = "lambda-web-mail"
+           "Name"        = "web-mail-api"
+           "Owner"       = "zbmowrey"
+           "Terraform"   = "true"
        }

+       domain_name_configuration {
+           certificate_arn    = "arn:aws:acm:us-east-1:070354330272:certificate/0b48523c-8f83-4945-8d21-0d392bd8e1e9"
+           endpoint_type      = "REGIONAL"
+           hosted_zone_id     = (known after apply)
+           security_policy    = "TLS_1_2"
+           target_domain_name = (known after apply)
        }
    }

  # module.gilfoyle-api.aws_apigatewayv2_integration.this["$default"] will be created
+   resource "aws_apigatewayv2_integration" "this" {
+       api_id                                    = (known after apply)
+       connection_id                             = (known after apply)
+       connection_type                           = "INTERNET"
+       id                                        = (known after apply)
+       integration_method                        = "POST"
+       integration_response_selection_expression = (known after apply)
+       integration_type                          = (known after apply)
+       integration_uri                           = (known after apply)
+       payload_format_version                    = "1.0"
+       timeout_milliseconds                      = (known after apply)
    }

  # module.gilfoyle-api.aws_apigatewayv2_integration.this["POST /"] will be created
+   resource "aws_apigatewayv2_integration" "this" {
+       api_id                                    = (known after apply)
+       connection_id                             = (known after apply)
+       connection_type                           = "INTERNET"
+       id                                        = (known after apply)
+       integration_method                        = "POST"
+       integration_response_selection_expression = (known after apply)
+       integration_type                          = (known after apply)
+       integration_uri                           = (known after apply)
+       payload_format_version                    = "2.0"
+       timeout_milliseconds                      = 12000
    }

  # module.gilfoyle-api.aws_apigatewayv2_route.this["$default"] will be created
+   resource "aws_apigatewayv2_route" "this" {
+       api_id             = (known after apply)
+       api_key_required   = false
+       authorization_type = "NONE"
+       id                 = (known after apply)
+       route_key          = "$default"
+       target             = (known after apply)
    }

  # module.gilfoyle-api.aws_apigatewayv2_route.this["POST /"] will be created
+   resource "aws_apigatewayv2_route" "this" {
+       api_id             = (known after apply)
+       api_key_required   = false
+       authorization_type = "NONE"
+       id                 = (known after apply)
+       route_key          = "POST /"
+       target             = (known after apply)
    }

  # module.gilfoyle-api.aws_apigatewayv2_stage.default[0] will be created
+   resource "aws_apigatewayv2_stage" "default" {
+       api_id        = (known after apply)
+       arn           = (known after apply)
+       auto_deploy   = true
+       deployment_id = (known after apply)
+       execution_arn = (known after apply)
+       id            = (known after apply)
+       invoke_url    = (known after apply)
+       name          = "$default"
+       tags          = {
+           "Module" = "lambda-web-mail"
+           "Name"   = "web-mail-api"
        }
+       tags_all      = {
+           "CostCenter"  = "zbmowrey-com"
+           "Environment" = "staging"
+           "Module"      = "lambda-web-mail"
+           "Name"        = "web-mail-api"
+           "Owner"       = "zbmowrey"
+           "Terraform"   = "true"
        }

+       access_log_settings {
+           destination_arn = (known after apply)
+           format          = (known after apply)
        }
    }

  # module.gilfoyle-lambda.data.aws_iam_policy_document.additional_inline[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "additional_inline"  {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "dynamodb:GetItem",
+               "dynamodb:Query",
+               "dynamodb:UpdateItem",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
            ]
+           sid       = "dynamodb"
        }
    }

  # module.gilfoyle-lambda.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs"  {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "logs:CreateLogGroup",
+               "logs:CreateLogStream",
+               "logs:PutLogEvents",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
+               (known after apply),
            ]
        }
    }

  # module.gilfoyle-lambda.aws_cloudwatch_log_group.lambda[0] will be created
+   resource "aws_cloudwatch_log_group" "lambda" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       name              = "/aws/lambda/zbmowrey-com-staging-gilfoyle"
+       retention_in_days = 0
+       tags              = {
+           "CostCenter" = "lambda-gilfoyle"
        }
+       tags_all          = {
+           "CostCenter"  = "lambda-gilfoyle"
+           "Environment" = "staging"
+           "Owner"       = "zbmowrey"
+           "Terraform"   = "true"
        }
    }

  # module.gilfoyle-lambda.aws_iam_policy.additional_inline[0] will be created
+   resource "aws_iam_policy" "additional_inline" {
+       arn       = (known after apply)
+       id        = (known after apply)
+       name      = "zbmowrey-com-staging-gilfoyle-inline"
+       path      = "/"
+       policy    = (known after apply)
+       policy_id = (known after apply)
+       tags      = {
+           "CostCenter" = "lambda-gilfoyle"
        }
+       tags_all  = {
+           "CostCenter"  = "lambda-gilfoyle"
+           "Environment" = "staging"
+           "Owner"       = "zbmowrey"
+           "Terraform"   = "true"
        }
    }

  # module.gilfoyle-lambda.aws_iam_policy.logs[0] will be created
+   resource "aws_iam_policy" "logs" {
+       arn       = (known after apply)
+       id        = (known after apply)
+       name      = "zbmowrey-com-staging-gilfoyle-logs"
+       path      = "/"
+       policy    = (known after apply)
+       policy_id = (known after apply)
+       tags      = {
+           "CostCenter" = "lambda-gilfoyle"
        }
+       tags_all  = {
+           "CostCenter"  = "lambda-gilfoyle"
+           "Environment" = "staging"
+           "Owner"       = "zbmowrey"
+           "Terraform"   = "true"
        }
    }

  # module.gilfoyle-lambda.aws_iam_role.lambda[0] will be created
+   resource "aws_iam_role" "lambda" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "lambda.amazonaws.com"
                        }
+                       Sid       = ""
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = true
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "zbmowrey-com-staging-gilfoyle"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags                  = {
+           "CostCenter" = "lambda-gilfoyle"
        }
+       tags_all              = {
+           "CostCenter"  = "lambda-gilfoyle"
+           "Environment" = "staging"
+           "Owner"       = "zbmowrey"
+           "Terraform"   = "true"
        }
+       unique_id             = (known after apply)

+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

  # module.gilfoyle-lambda.aws_iam_role_policy_attachment.additional_inline[0] will be created
+   resource "aws_iam_role_policy_attachment" "additional_inline" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "zbmowrey-com-staging-gilfoyle"
    }

  # module.gilfoyle-lambda.aws_iam_role_policy_attachment.logs[0] will be created
+   resource "aws_iam_role_policy_attachment" "logs" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "zbmowrey-com-staging-gilfoyle"
    }

  # module.gilfoyle-lambda.aws_lambda_function.this[0] will be created
+   resource "aws_lambda_function" "this" {
+       architectures                  = (known after apply)
+       arn                            = (known after apply)
+       description                    = "Provides a webhook for Slack user impersonation."
+       filename                       = "builds/f97a18fb109a7ec4291cbe3956808f7cd8431aeede4f2981527ce6bcade3c6d1.zip"
+       function_name                  = "zbmowrey-com-staging-gilfoyle"
+       handler                        = "handle.handle"
+       id                             = (known after apply)
+       invoke_arn                     = (known after apply)
+       last_modified                  = (known after apply)
+       memory_size                    = 128
+       package_type                   = "Zip"
+       publish                        = false
+       qualified_arn                  = (known after apply)
+       reserved_concurrent_executions = -1
+       role                           = (known after apply)
+       runtime                        = "python3.8"
+       signing_job_arn                = (known after apply)
+       signing_profile_version_arn    = (known after apply)
+       source_code_hash               = (known after apply)
+       source_code_size               = (known after apply)
+       tags                           = {
+           "CostCenter" = "lambda-gilfoyle"
        }
+       tags_all                       = {
+           "CostCenter"  = "lambda-gilfoyle"
+           "Environment" = "staging"
+           "Owner"       = "zbmowrey"
+           "Terraform"   = "true"
        }
+       timeout                        = 3
+       version                        = (known after apply)

+       environment {
+           variables = {
+               "Serverless" = "Terraform"
            }
        }

+       tracing_config {
+           mode = (known after apply)
        }
    }

  # module.gilfoyle-lambda.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "pip",
+                       "python3.8",
+                       "lambda-gilfoyle/requirements.txt",
+                       null,
                    ],
+                   [
+                       "zip",
+                       "lambda-gilfoyle/",
+                       null,
                    ],
                ]
+               filename      = "builds/f97a18fb109a7ec4291cbe3956808f7cd8431aeede4f2981527ce6bcade3c6d1.zip"
+               runtime       = "python3.8"
            }
        )
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/f97a18fb109a7ec4291cbe3956808f7cd8431aeede4f2981527ce6bcade3c6d1.plan.json"
+       id                   = (known after apply)
    }

  # module.gilfoyle-lambda.null_resource.archive[0] will be created
+   resource "null_resource" "archive" {
+       id       = (known after apply)
+       triggers = {
+           "filename"  = "builds/f97a18fb109a7ec4291cbe3956808f7cd8431aeede4f2981527ce6bcade3c6d1.zip"
+           "timestamp" = "1636035880989687000"
        }
    }

Plan: 27 to add, 0 to change, 0 to destroy.
```
</details>